"use strict";
//#bq1zkx7WP
//
// *** (подібне було вище, але…будьте уважні в другій частині) створити сторінку з довільним блоком, в середині якого є значення “100грн”
//
// при перезавантаженні сторінки до значення додається по 10грн, але !!! зміна ціни відбувається тільки на перезавантаження, які відбулись пізніше ніж 10 секунд після попереднього.
//
//  При перезавантаженні, яке відбулось раніше ніж минуло 10 секунд, нічого не відбувається
//витягла прайс з лс, задала за замовчуваняям (??) значення 100
let price = +(localStorage.getItem('price') ?? 100);
//витягла час завантаження, задала дефолтне 0, якщо його нема
let lastUpdate = +(localStorage.getItem('lastUpdate') ?? 0);
//якщо зараз більше, ніж останнє оновлення + 10 сек., то
if (Date.now() > lastUpdate + 10000) {
    //ціна стає на 10 більше
    price = price + 10;
    //повертаю в лс нову ціну
    localStorage.setItem('price', price.toString());
    //повертаю в лс новий час завантаження
    localStorage.setItem('lastUpdate', Date.now().toString());
}
//виводжу інформацію в дів
let div = document.querySelector('#money');
if (div) {
    div.innerHTML = `${price} грн.`;
}
